tree ada630e1da499723c827ba0ff1084f93daf9ed9c
parent b89e3859db0658df57abfb1396ebad8d1f4580bb
author Steve French <stfrench@microsoft.com> 1552856318 -0500
committer Sasha Levin <sashal@kernel.org> 1553731709 -0400

fix incorrect error code mapping for OBJECTID_NOT_FOUND

[ Upstream commit 85f9987b236cf46e06ffdb5c225cf1f3c0acb789 ]

It was mapped to EIO which can be confusing when user space
queries for an object GUID for an object for which the server
file system doesn't support (or hasn't saved one).

As Amir Goldstein suggested this is similar to ENOATTR
(equivalently ENODATA in Linux errno definitions) so
changing NT STATUS code mapping for OBJECTID_NOT_FOUND
to ENODATA.

Signed-off-by: Steve French <stfrench@microsoft.com>
CC: Amir Goldstein <amir73il@gmail.com>
Signed-off-by: Sasha Levin <sashal@kernel.org>
tree 177406e154e212315d42171d0739649586154721
parent e35c5a2759f360a45f052b422a87c47971a4e2d9
author Linus Torvalds <torvalds@linux-foundation.org> 1416184580 -0800
committer Linus Torvalds <torvalds@linux-foundation.org> 1416184580 -0800

Linux 3.18-rc5
tree f611cbb3ae94b19263f8b25a0caa0c272c89d73d
parent 42c36f63ac1366ab0ecc2d5717821362c259f517
author Linus Torvalds <torvalds@linux-foundation.org> 1304994834 -0700
committer Linus Torvalds <torvalds@linux-foundation.org> 1304994834 -0700

Linux 2.6.39-rc7
tree e47877bba85aed21b464652ced3bfe80e857bd61
parent 51844b0f04d8f6ffff34bb7de74ea2dfc7eb1642

committer Linus Torvalds <torvalds@linux-foundation.org> 1328757713 -0800

Linux 3.3-rc3
tree f65bb936dcd559a910889fbc38145d6e27a01473
parent 629d0452604e4e2acc7cd3b8efd4ce92330dc178
author Sasha Levin <alexander.levin@verizon.com> 1470708705 -0400
committer Sasha Levin <alexander.levin@verizon.com> 1470708705 -0400

Linux 4.1.30

Signed-off-by: Sasha Levin <alexander.levin@verizon.com>
tree a58ca78e698a41faeef7458a79aa85ecd8b4a148
parent 9f546f6a54dadda3f5743dca2c5e1ba0c472f792
author Parav Pandit <parav@mellanox.com> 1531731013 +0300
committer Sasha Levin <alexander.levin@microsoft.com> 1536947685 -0400

RDMA/cma: Do not ignore net namespace for unbound cm_id

[ Upstream commit 643d213a9a034fa04f5575a40dfc8548e33ce04f ]

Currently if the cm_id is not bound to any netdevice, than for such cm_id,
net namespace is ignored; which is incorrect.

Regardless of cm_id bound to a netdevice or not, net namespace must
match. When a cm_id is bound to a netdevice, in such case net namespace
and netdevice both must match.

Fixes: 4c21b5bcef73 ("IB/cma: Add net_dev and private data checks to RDMA CM")
Signed-off-by: Parav Pandit <parav@mellanox.com>
Reviewed-by: Daniel Jurgens <danielj@mellanox.com>
Signed-off-by: Leon Romanovsky <leonro@mellanox.com>
Signed-off-by: Jason Gunthorpe <jgg@mellanox.com>
Signed-off-by: Sasha Levin <alexander.levin@microsoft.com>
tree d0278271092e35263c103c8a5e7e9a19efa93756
parent 8fa3c2132bb69f475a338d0e346af4f24879a4cd
author Randy Dunlap <rdunlap@infradead.org> 1512757159 -0800
committer Sasha Levin <alexander.levin@microsoft.com> 1524698410 -0400

kdb: make "mdr" command repeat

[ Upstream commit 1e0ce03bf142454f38a5fc050bf4fd698d2d36d8 ]

The "mdr" command should repeat (continue) when only Enter/Return
is pressed, so make it do so.

Signed-off-by: Randy Dunlap <rdunlap@infradead.org>
Cc: Daniel Thompson <daniel.thompson@linaro.org>
Cc: Jason Wessel <jason.wessel@windriver.com>
Cc: kgdb-bugreport@lists.sourceforge.net
Signed-off-by: Jason Wessel <jason.wessel@windriver.com>
Signed-off-by: Sasha Levin <alexander.levin@microsoft.com>
tree cc570e5654ea8a60672fc802bdf60c06e2d1797e
parent 174788ee57cd13adf92721cca0d8a69bd9b6a345
author Daniel Borkmann <daniel@iogearbox.net> 1527909719 +0200
committer Sasha Levin <alexander.levin@microsoft.com> 1528316771 -0400

bpf: fix uapi hole for 32 bit compat applications

[ Upstream commit 36f9814a494a874d5a0f44843544b4b2539022db ]

In 64 bit, we have a 4 byte hole between ifindex and netns_dev in the
case of struct bpf_map_info but also struct bpf_prog_info. In net-next
commit b85fab0e67b ("bpf: Add gpl_compatible flag to struct bpf_prog_info")
added a bitfield into it to expose some flags related to programs. Thus,
add an unnamed __u32 bitfield for both so that alignment keeps the same
in both 32 and 64 bit cases, and can be naturally extended from there
as in b85fab0e67b.

Before:

  # file test.o
  test.o: ELF 32-bit LSB relocatable, Intel 80386, version 1 (SYSV), not stripped
  # pahole test.o
  struct bpf_map_info {
	__u32                      type;                 /*     0     4 */
	__u32                      id;                   /*     4     4 */
	__u32                      key_size;             /*     8     4 */
	__u32                      value_size;           /*    12     4 */
	__u32                      max_entries;          /*    16     4 */
	__u32                      map_flags;            /*    20     4 */
	char                       name[16];             /*    24    16 */
	__u32                      ifindex;              /*    40     4 */
	__u64                      netns_dev;            /*    44     8 */
	__u64                      netns_ino;            /*    52     8 */

	/* size: 64, cachelines: 1, members: 10 */
	/* padding: 4 */
  };

After (same as on 64 bit):

  # file test.o
  test.o: ELF 32-bit LSB relocatable, Intel 80386, version 1 (SYSV), not stripped
  # pahole test.o
  struct bpf_map_info {
	__u32                      type;                 /*     0     4 */
	__u32                      id;                   /*     4     4 */
	__u32                      key_size;             /*     8     4 */
	__u32                      value_size;           /*    12     4 */
	__u32                      max_entries;          /*    16     4 */
	__u32                      map_flags;            /*    20     4 */
	char                       name[16];             /*    24    16 */
	__u32                      ifindex;              /*    40     4 */

	/* XXX 4 bytes hole, try to pack */

	__u64                      netns_dev;            /*    48     8 */
	__u64                      netns_ino;            /*    56     8 */
	/* --- cacheline 1 boundary (64 bytes) --- */

	/* size: 64, cachelines: 1, members: 10 */
	/* sum members: 60, holes: 1, sum holes: 4 */
  };

Reported-by: Dmitry V. Levin <ldv@altlinux.org>
Reported-by: Eugene Syromiatnikov <esyr@redhat.com>
Fixes: 52775b33bb507 ("bpf: offload: report device information about offloaded maps")
Fixes: 675fc275a3a2d ("bpf: offload: report device information for offloaded programs")
Signed-off-by: Daniel Borkmann <daniel@iogearbox.net>
Acked-by: Alexei Starovoitov <ast@kernel.org>
Signed-off-by: Alexei Starovoitov <ast@kernel.org>
Signed-off-by: Sasha Levin <alexander.levin@microsoft.com>
tree ea019826653e49aab7d7b1df23d0bcba67c590a4
parent c6b993f6b64bb33957c391a3d5669081a8eedcb2
author Xiao Liang <xiliang@redhat.com> 1534260088 +0800
committer Sasha Levin <alexander.levin@microsoft.com> 1537021461 -0400

xen-netfront: fix warn message as irq device name has '/'

